app/Nova/EmployeeChangeRequest.php

select exists(select * from `employee_change_requests` where `status` = 'pending') as `exists`
---
    public function menu(\Illuminate\Http\Request $request)
    {
        return parent::menu($request)->withBadgeIf(
            fn () => (string) \App\Models\EmployeeChangeRequest::where('status', \App\Models\EmployeeChangeRequest::STATUS_PENDING)->count(),
            'warning',
            fn () => ($request->user()?->can('EmployeeChangeApprove') ?? false)
                && \App\Models\EmployeeChangeRequest::where('status', \App\Models\EmployeeChangeRequest::STATUS_PENDING)->exists()
        );